{
  "tematy": {
    "1": "Historia rozwoju systemów operacyjnych – od pierwszych komputerów do współczesnych systemów.",
    "2": "Architektura systemów operacyjnych – przegląd i porównanie różnych architektur (monolityczna, mikrojądro, hybrydowa).",
    "3": "Rola jądra systemu operacyjnego – jak jądro zarządza zasobami i zapewnia funkcje systemowe.",
    "4": "Systemy operacyjne czasu rzeczywistego – przykłady i zastosowania w przemyśle.",
    "5": "Procesy i wątki w systemach operacyjnych – różnice, zarządzanie i synchronizacja.",
    "6": "Zarządzanie pamięcią w systemach operacyjnych – techniki i algorytmy.",
    "7": "Pamięć wirtualna – jak działa i jakie ma zalety oraz wady.",
    "8": "Systemy plików w systemach operacyjnych – porównanie popularnych systemów plików (NTFS, ext, FAT).",
    "9": "Bezpieczeństwo w systemach operacyjnych – techniki ochrony przed atakami i zarządzanie uprawnieniami.",
    "10": "Mechanizmy synchronizacji w systemach operacyjnych – semafory, muteksy, bariery.",
    "11": "Planowanie procesów – algorytmy zarządzania zadaniami (FCFS, RR, SJF, etc.).",
    "12": "Wielozadaniowość a wielowątkowość – różnice, korzyści i wyzwania.",
    "13": "Mechanizmy komunikacji międzyprocesowej (IPC) – metody i ich zastosowania.",
    "14": "Systemy operacyjne typu Unix i Linux – historia, rozwój i zastosowania.",
    "15": "Windows vs. Linux – porównanie architektury i funkcji systemów operacyjnych.",
    "16": "Systemy operacyjne dla urządzeń mobilnych – porównanie Androida, iOS, KaiOS.",
    "17": "Zarządzanie wejściem/wyjściem w systemach operacyjnych – strategie i urządzenia I/O.",
    "18": "Algorytmy zarządzania pamięcią – różnice między stronicowaniem, segmentacją, swappingiem.",
    "19": "Zarządzanie energią w systemach operacyjnych – jak systemy optymalizują zużycie energii.",
    "20": "Mechanizmy kontroli dostępu w systemach operacyjnych – ACL, RBAC i inne techniki.",
    "21": "Bezpieczeństwo systemów plików – szyfrowanie, uprawnienia, kopie zapasowe.",
    "22": "Systemy operacyjne w chmurze – jak OS-y wspierają usługi cloud computing.",
    "23": "Mechanizmy odzyskiwania po awarii w systemach operacyjnych – kopie zapasowe i redundancja.",
    "24": "Maszyny wirtualne a systemy operacyjne – jak wirtualizacja wpływa na zarządzanie zasobami.",
    "25": "Linux w serwerach – zastosowania, wydajność i bezpieczeństwo.",
    "26": "Systemy plików rozproszonych – jak działają i jakie są ich korzyści.",
    "27": "Optymalizacja wydajności systemu operacyjnego – narzędzia i techniki.",
    "28": "Systemy operacyjne dla serwerów – czym różnią się od systemów desktopowych.",
    "29": "Technologie kontenerów (Docker, Kubernetes) – jak wpływają na zarządzanie zasobami systemowymi.",
    "30": "Wirtualizacja i systemy operacyjne – jak systemy zarządzają maszynami wirtualnymi.",
    "31": "Systemy operacyjne dla komputerów kwantowych – wyzwania i perspektywy.",
    "32": "Algorytmy zarządzania dyskiem w systemach operacyjnych – kolejka FCFS, SCAN, C-SCAN.",
    "33": "Systemy operacyjne wbudowane – zastosowania i cechy systemów real-time.",
    "34": "Zarządzanie zasobami w systemach wieloprocesorowych – techniki i wyzwania.",
    "35": "Systemy operacyjne w superkomputerach – jak zarządzają dużą liczbą procesorów.",
    "36": "Mechanizmy debugowania i monitorowania w systemach operacyjnych – narzędzia i techniki.",
    "37": "Zarządzanie procesami w systemie Unix – sygnały, potoki, fork i exec.",
    "38": "MacOS jako system operacyjny – architektura, zalety i wady.",
    "39": "Algorytmy zarządzania pamięcią w systemach czasu rzeczywistego – wymogi i implementacja.",
    "40": "Systemy operacyjne dla Internetu Rzeczy (IoT) – wymagania i przykłady.",
    "41": "Mechanizmy ochrony danych w systemach operacyjnych – od zapory sieciowej po szyfrowanie.",
    "42": "Zarządzanie pamięcią podręczną (cache) – rola i algorytmy.",
    "43": "Przyszłość systemów operacyjnych – nowe trendy i technologie.",
    "44": "Systemy plików transakcyjne – jak działają i gdzie są stosowane.",
    "45": "Open-source vs. zamknięte systemy operacyjne – zalety, wady i perspektywy rozwoju.",
    "46": "Systemy operacyjne dla gier komputerowych – jak optymalizują wydajność.",
    "47": "Systemy operacyjne a bezpieczeństwo w sieci – firewall, IDS/IPS i inne mechanizmy ochrony.",
    "48": "Rozwój systemów operacyjnych dla pojazdów autonomicznych – wyzwania i przykłady.",
    "49": "Migracja systemów operacyjnych – wyzwania związane z aktualizacją i zmieniającymi się wymaganiami sprzętowymi.",
    "50": "Otwarty system operacyjny Minix – jego znaczenie dla edukacji i rozwoju innych systemów."
  }
}
